<template>
  <div class="about">
    <h1>數學即時賽聯盟</h1>
    <h2>競賽與舞台</h2>
    <p>
      競賽總是讓人血脈賁張，膠著拉艍的戰況更是讓人緊張不已，雖然比賽單位盡可能使比賽公平，但仍然有許多不是選手可掌控的因素，使選手的表現出人意表。有的選手藉著天時、地利和人和；又或著進行密秘特訓，上演黑馬記；也有選手因為緊張或無法呈受比賽壓力，表現失常而令粉絲心碎。但也正因這些不可測的元素，讓比賽更使人著迷。
    </p>
    <p>
      競賽舞台非勝即負的特性雖然對選手十分殘忍，但是萬眾矚目的舞台，還是讓選手們心懷「雖千萬人，吾往矣」的心志，而將青春歲月投注於此而不後悔。人類的各種活動，一旦發展一段時間，莫不想方設法替選手們打造一個屬於他們的舞台，讓更多的人觀賞，也招募更多的選手投入，壯大此項活動的人氣。
      數學是人類的重要科學活動，但是除了象牙般數學奧林匹亞競賽，甚少有融人普羅大眾的競賽活動。若詢問街上路人，今年世界數學奧匹冠軍是那個國家，主力選手是那位，能夠回答的人應該是寥寥可數，而世人長久以來，也習慣將數學定位少數人的靜態競賽活動。
    </p>
    <p>  
      一次參與九九文教基金會主辦的TRML數學競賽，當比賽來到壓軸的個人賽，當閱卷老師們公佈參賽同學答題的結果，兩位同學並列最高分，由於首獎只有一位，兩位同學必須在台上進行驟死賽一題，先答對者獲得首獎。於是緊張的氣氛瞬間瀰漫整個會場，靜待結果分曉。這個場景讓我興起數學即時賽的念頭，著手數學即時賽的規則訂定，而隨著網路使用者的普及，也同時開始設計網路即時賽平台。
    </p>
    <h2>數學即時PK賽規則</h2>
    <ol>
      <li>題目型式為選填題，電腦作答。</li>
      <li>比賽由電腦從題庫出現30題。</li>
      <li>由裁判或電腦從30題中隨機挑選題目進行比賽。</li>
      <li>一題。</li>
      <li>每題每人有2次作答機會。</li>
      <li>先答對此題者為勝方，得2分，另一人為敗方得0分，若兩人皆未在2次機會中答對，各得1分。</li>
      <li>一局</li>
      <li>一局比賽以先得6分的一方為勝方；但雙方均得5分後，以先領先對方2分的一方為勝方。</li>
      <li>一場</li>
      <li>一場應由任何奇數局所組成。</li>
    </ol>
  </div>
</template>

<style scoped>
  .about {
    width: 800px;
    margin: 0 auto;
  }
  p {
    text-align: justify;
    text-justify:inter-ideograph;
    line-height: 2;
    text-indent: 2em;
  }
  li {
    text-align: left;
    margin-bottom: 5px;
  }
</style>
